HELYXcore-4.4.0/examples/legacy/combustion/XiDyMFoam/annularCombustorTurbine/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (4 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            cylindricalInletVelocity;
        centre          (-0.64 0.5 0);
        axis            (1 0 0);
        axialVelocity   40;
        radialVelocity  20;
        rpm             12732; // ut=40,r=3e-2,omega=ut/r,rpm=omega*60/(2*pi)
        value           uniform (0 0 0);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        inletValue      (0 0 0);
        value           $internalField;
    }
    wall
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
