HELYXcore-4.4.0/examples/legacy/combustion/XiDyMFoam/annularCombustorTurbine/Allrun
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $HELYX_PROJECT_DIR/bin/tools/RunFunctions

./Allrun.mesh

restore0Dir

runApplication decomposePar -force

runParallel potentialFoam -pName pPotential -initialiseUBCs

\rm -f processor*/0/phi

runParallel XiDyMFoam

#------------------------------------------------------------------------------
