HELYXcore-4.4.0/examples/legacy/combustion/XiDyMFoam/annularCombustorTurbine/Allrun.mesh
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $HELYX_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh

runApplication -s cyclic \
    createPatch -dict system/createPatchDict.cyclic -overwrite

runApplication helyxHexMesh -overwrite

rm -rf 0

runApplication -s ami \
    createPatch -dict system/createPatchDict.ami -overwrite

runApplication transformPoints -scale '(0.01 0.01 0.01)'

runApplication mergeOrSplitBaffles -split -overwrite

#------------------------------------------------------------------------------
